In [3]:
import numpy as np

In [6]:
np.ones((4, 4), int)

array([[1, 1, 1, 1],
       [1, 1, 1, 1],
       [1, 1, 1, 1],
       [1, 1, 1, 1]])

In [7]:
np.full(4, 5, float)

array([5., 5., 5., 5.])

In [17]:
sonuc=np.random.normal(10, 5,  (4, 5)) # Birincisi ortalaması 10 olan standart sapması 5 olan 5x4 boyutunda random sayılar oluşturur.
sonuc

array([[ 7.00797228,  1.51636099,  9.3357128 ,  6.93843704, 16.19443813],
       [13.64305401, 11.43478022, 13.60336276,  3.11421102,  0.98019868],
       [ 7.54029768, 17.31956899,  8.39607145,  7.53527304, 17.23016169],
       [-0.64264101, 11.44750733,  1.35492147,  7.97797541,  9.07490488]])

In [18]:
sonuc.shape

(4, 5)

In [26]:
dizi=np.random.randint(0, 100, ( 4, 4))

In [27]:
dizi

array([[36, 23,  7, 99],
       [87, 44, 73, 35],
       [20, 51, 31,  5],
       [27, 46, 52, 34]])

In [44]:
dizi[0:3, 0:3]

array([[36, 23,  7],
       [87, 44, 73],
       [20, 51, 31]])

In [56]:
dizi=[1, 2, 3, 4, 5]
dizi=np.array([dizi])
dizi

array([[1, 2, 3, 4, 5]])

In [50]:
dizi.mean()
dizi.var()
dizi.sum()

15

In [53]:
import pandas as pd

In [73]:
dizi=[1, 5, 3, 4, 5, 6]
dizi=pd.Series(dizi)

In [69]:
type(dizi)

pandas.core.series.Series

In [74]:
dizi.axes

[RangeIndex(start=0, stop=6, step=1)]

In [75]:
dizi.ndim

1

In [76]:
dizi.size

6

In [77]:
dizi.shape

(6,)

In [11]:
seri["2":"1"]

pd.concat([seri, seri])

2    1
4    2
6    3
8    4
0    5
1    6
dtype: int64

In [1]:
import pandas as pd

In [2]:
pd.Series([1, 2, 3, 4, 5, 6])

seri=pd.Series([1, 2, 3, 4, 5, 6], index=["2", "4", "6", "8", "0", "1"])

seri=pd.Series([1, 2, 3, 4, 5, 6], index=["2", "4", "6", "8", "0", "1"])

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [9]:
seri=pd.Series([1, 2, 3, 4, 5, 6], index=["2", "4", "6", "8", "0", "1"])

In [12]:
pd.concat([seri, seri])

2    1
4    2
6    3
8    4
0    5
1    6
2    1
4    2
6    3
8    4
0    5
1    6
dtype: int64

In [4]:
import numpy as np 
import pandas as pd

In [13]:
np_array=np.random.randint(0, 10, 10)

In [18]:
sonuc=pd.Series(np_array, index=["a", "b", "c", "d", "e", "f", "g", "h", "j", "k" ])
type(sonuc)

pandas.core.series.Series

In [19]:
sonuc.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'j', 'k'], dtype='object')

In [23]:
sonuc.keys

<bound method Series.keys of a    5
b    9
c    8
d    4
e    8
f    6
g    9
h    8
j    7
k    3
dtype: int32>

In [30]:
key="z"
if key in sonuc:
    print(sonuc[key])
if key not in sonuc:
    print(f"{key} not in sonuc of Seris")

z not in sonuc of Seris

In [58]:
sonuc["a"]
np_array=np.arange(1, 51)
np_array=np_array.reshape(10, 5)

In [59]:
frame=pd.DataFrame(np_array, columns=["Degisken ismi1", "Degisken ismi2", "Degisken ismi3", "Degisken ismi4", "Degisken ismi5"])

In [60]:
frame.axes

[RangeIndex(start=0, stop=10, step=1),
 Index(['Degisken ismi1', 'Degisken ismi2', 'Degisken ismi3', 'Degisken ismi4',
        'Degisken ismi5'],
       dtype='object')]

In [61]:
frame.ndim

2

In [62]:
frame.size

50

In [63]:
frame.head()

,Degisken ismi1,Degisken ismi2,Degisken ismi3,Degisken ismi4,Degisken ismi5
0,1,2,3,4,5
1,6,7,8,9,10
2,11,12,13,14,15
3,16,17,18,19,20
4,21,22,23,24,25

In [64]:
frame.tail()

,Degisken ismi1,Degisken ismi2,Degisken ismi3,Degisken ismi4,Degisken ismi5
5,26,27,28,29,30
6,31,32,33,34,35
7,36,37,38,39,40
8,41,42,43,44,45
9,46,47,48,49,50

In [66]:
m=np.random.randint(1, 30, (10, 3))
n=pd.DataFrame(m, columns=["Var_1", "Var_2", "Var_3"])
n

   Var_1  Var_2  Var_3
0     11      6      5
1     20     18      7
2      6     13     29
3     23     15     14
4     22      2      6
5     26     29     19
6     14     14      7
7     13     14     10
8     28     16     29
9     10     26     24

In [75]:
n[["Var_1"]][0:3]

   Var_1
0     11
1     20
2      6

In [76]:
n.Var_1

0    11
1    20
2     6
3    23
4    22
5    26
6    14
7    13
8    28
9    10
Name: Var_1, dtype: int32

In [83]:
n[(n.Var_1>10) & (n.Var_1<20)]

   Var_1  Var_2  Var_3
0     11      6      5
6     14     14      7
7     13     14     10

In [88]:
a = n + 10
a

   Var_1  Var_2  Var_3
0     21     16     15
1     30     28     17
2     16     23     39
3     33     25     24
4     32     12     16
5     36     39     29
6     24     24     17
7     23     24     20
8     38     26     39
9     20     36     34

In [89]:
n

   Var_1  Var_2  Var_3
0     11      6      5
1     20     18      7
2      6     13     29
3     23     15     14
4     22      2      6
5     26     29     19
6     14     14      7
7     13     14     10
8     28     16     29
9     10     26     24

In [92]:
pd_concat=pd.concat([a, n])
pd_concat

   Var_1  Var_2  Var_3
0     21     16     15
1     30     28     17
2     16     23     39
3     33     25     24
4     32     12     16
5     36     39     29
6     24     24     17
7     23     24     20
8     38     26     39
9     20     36     34
0     11      6      5
1     20     18      7
2      6     13     29
3     23     15     14
4     22      2      6
5     26     29     19
6     14     14      7
7     13     14     10
8     28     16     29
9     10     26     24